CSI API ETABS v1

# cDesignShearWallGetRebarPrefsSpandrel Method

---

Retrieves data from the Rebar Selection Rules for Wall Spandrels

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetRebarPrefsSpandrel(
    	int Item,
    	ref string Value
    )

    Function GetRebarPrefsSpandrel (
    	Item As Integer,
    	ByRef Value As String
    ) As Integer

    Dim instance As cDesignShearWall
    Dim Item As Integer
    Dim Value As String
    Dim returnValue As Integer

    returnValue = instance.GetRebarPrefsSpandrel(Item,
    	Value)

    int GetRebarPrefsSpandrel(
    	int Item,
    	String^% Value
    )

    abstract GetRebarPrefsSpandrel :
            Item : int *
            Value : string byref -> int

#### Parameters

Item

    Type: SystemInt32
An integer value corresponding to the data to be retrieved, from the following
list

  1. Horizontal Top/Bottom Bars - Smallest bar size
  2. Horizontal Top/Bottom Bars - Largest bar size
  3. Horizontal Top/Bottom Bars - Preferred bar size
  4. Horizontal Web Bars - Bar size
  5. Horizontal Web Bars - Minimum Spacing of Bars
  6. Horizontal Web Bars - Maximum Spacing of Bars
  7. Vertical Bars/Ties - Stirrup Bar size
  8. Vertical Bars/Ties - Minimum Spacing of Bars
  9. Vertical Bars/Ties - Maximum Spacing of Bars
  10. Diagonal Bars - Smallest bar size
  11. Diagonal Bars - Largest bar size
  12. Diagonal Bars - Preferred bar size
  13. Diagonal Bar Ties - Stirrup bar size
  14. Diagonal Bar Ties - Minimum Spacing of ties
  15. Diagonal Bar Ties - Maximum Spacing of ties

Value

    Type: SystemString
The retrieved data; note that numerical values are converted to String

#### Return Value

Type: Int32
Returns zero if the data is successfully retrieved; otherwise returns non-zero

See Also

#### Reference

cDesignShearWall Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com